{"nodes":[{"title":"1984 Apple Commercial","slug":"__1984++++Apple++++Commercial","shortSummary":"a. I would be very intrigued, as this commercial say pretty much nothing about the product itself. However, I would see the Apple Macintosh as being groundbreaking and revolutionary. The ad positions the Macintosh as something that will break the"},{"title":"FEEL. – Kendrick Lamar","slug":"__FEEL.++++–++++Kendrick++++Lamar","shortSummary":"titlethe word “feel” appears in the title but is also the start of the entire first verse “I feel…”shows the more introspective and honest nature of the song compared to ELEMENT., the previous oneno official music videointrothe line “ain’t nobody"},{"title":"Franz Kafka","slug":"__Franz++++Kafka","shortSummary":"German-speaking Jew from PragueKafka’s father was tyrannical and Kafka found a way to express himself in his fiction by creating characters who are shy, passive, and sensitive victims who struggle against authoritarian forcesfelt estranged from other people for not being"},{"title":"How and why do people study language and literature?","slug":"__How++++and++++why++++do++++people++++study++++language++++and++++literature?","shortSummary":"Since the dawn of time, humans have been making stories. Those stories, naturally, are reflections of the author’s life and context, of the author’s worldview. Thus, stories can be seen as time capsules, which allow us to immerse ourselves into"},{"title":"How do readers approach texts from different times and different cultures from their own?","slug":"__How++++do++++readers++++approach++++texts++++from++++different++++times++++and++++different++++cultures++++from++++their++++own?","shortSummary":"Just like a text is influenced by the mindset and worldview of its author, it is influenced by the mindset and worldview of its reader. It could even be argued that, rather than carrying meaning, texts allow the reader to"},{"title":"How do the conventions of different types of text develop over time?","slug":"__How++++do++++the++++conventions++++of++++different++++types++++of++++text++++develop++++over++++time?","shortSummary":"The conventions of different types of text develop over time as a response to the shifting dynamics of society, culture, and the evolving needs of their audiences. Each form of writing—be it poetry, drama, fiction, or nonfiction—begins within a specific"},{"title":"Identity Collage","slug":"__Identity++++Collage","shortSummary":"![[Pasted image 20250303151514.png]]I chose the form of a collage because I believe it is the most fit for representing identity. Indeed, identity is never a clear-cut, monolithic representation of a person. It is a dynamic, ever-changing, multidimensional construct based on"},{"title":"Jane Eyre Red Room Analysis","slug":"__Jane++++Eyre++++Red++++Room++++Analysis","shortSummary":"This excerpt is from the start of Chapter 2 of Jane Eyre by Charlotte Brontë. In the text, Jane is locked in the red room due to her fighting with her cousin. Brontë builds an atmosphere of tension and suspense"},{"title":"Kafka Comparative Analysis","slug":"__Kafka++++Comparative++++Analysis","shortSummary":"Before the Law and In the Penal Colonyjustice and lawBefore the Lawsymbol of justicelaw is unattainablesymbolismgate symbolizes this elusiveness of justiceIn the Penal Colonyconcrete mechanical representation of justicelaw is absolute and brutalauthority figuresBefore the Lawthe gatekeeper represents bureaucratic authority blocking"},{"title":"The Metamorphosis Characterization","slug":"__The++++Metamorphosis++++Characterization","shortSummary":"In this first scene of The Metamorphosis, Kafka employs various characterization techniques in order to present Gregor as alienated from society and from his own humanity and authentic self, quite in line with the existentialist themes of the story. We"},{"title":"The Metamorphosis – Kafka","slug":"__The++++Metamorphosis++++–++++Kafka","shortSummary":"written in 1912, published in 1915 by [[Franz Kafka]]focuses on a tortured father-son relationship as well as the individual’s estrangement from societyhis grotesque images combined with his struggling and ultimately defeated hero, defined an age wherein the alienated man—the anti-hero—grapples"},{"title":"The Trapeze Artist – Kafka","slug":"__The++++Trapeze++++Artist++++–++++Kafka","shortSummary":"| Feature                 | Analysis                    "},{"title":"YAH. – Kendrick Lamar","slug":"__YAH.++++–++++Kendrick++++Lamar","shortSummary":"titleboth transcription of AAVE “yeah” (cultural background, racism, etc.) and shortened form of Yahweh (the god of the Bible)connects to what are arguably the two main themes of the albumpersonal narrative, introspection, spiritual questioningno official music videofirst versemelancholic and introspective"}],"edges":[{"source":"__The++++Metamorphosis++++–++++Kafka","target":"__Franz++++Kafka"}]}